package pro.edme.primitive.loops;

/**
 * Ярлыки и числа.
 * Ввести с клавиатуры целое число. Вывести на экран его строку-описание следующего вида:
 * "отрицательное четное число" - если число отрицательное и четное,
 * "отрицательное нечетное число" - если число отрицательное и нечетное,
 * "ноль" - если число равно 0,
 * "положительное четное число" - если число положительное и четное,
 * "положительное нечетное число" - если число положительное и нечетное.
 * <p>
 * Пример для числа 100:
 * положительное четное число
 * <p>
 * Пример для числа -51:
 * отрицательное нечетное число
 * <p>
 * Requirements:
 * 1. Программа должна считывать число с клавиатуры.
 * 2. Программа должна использовать команду System.out.println() или System.out.print().
 * 3. Если число отрицательное и четное, вывести "отрицательное четное число".
 * 4. Если число отрицательное и нечетное, вывести "отрицательное нечетное число".
 * 5. Если число равно 0, вывести "ноль".
 * 6. Если число положительное и четное, вывести "положительное четное число".
 * 7. Если число положительное и нечетное, вывести "положительное нечетное число".
 * 8. Название метода 'getText' менять нельзя.
 */

public class LabelsAndNumbers {
    public static void main(String[] args) {
        //TODO: Напишите тут ваш код.

        System.out.println(getText(4));
    }

    public static String getText(int number) {
        //TODO: Напишите тут ваш код.

        return "";
    }
}
