package pro.edme.primitive.loops;

/**
 * Три числа.
 * Ввести с клавиатуры три целых числа. Одно из чисел отлично от двух других, равных между собой.
 * Вывести на экран порядковый номер числа, отличного от остальных.
 * <p>
 * Пример для чисел 4 6 6:
 * 1
 * <p>
 * Пример для чисел 6 6 3:
 * 3
 * <p>
 * Requirements:
 * 1. Программа должна считывать числа c клавиатуры.
 * 2. Программа должна использовать команды System.out.println() или System.out.print().
 * 3. Программа должна выводить на экран порядковый номер числа, отличного от остальных.
 * 4. Если все числа разные, выводить 0.
 * 5. Название метода 'getDifferentNumber' менять нельзя.
 */

public class ThreeNumbers {
    public static void main(String[] args) {
        //TODO: Напишите тут ваш код.

        System.out.println(getDifferentNumber(4, 6, 6));
    }

    public static int getDifferentNumber(int numberOne, int numberTwo, int numberThree) {
        //TODO: Напишите тут ваш код.

        return 0;
    }
}
